(function() {"use strict";var __module = CC_EDITOR ? module : {exports:{}};var __filename = 'preview-scripts/assets/Script/ddz/ddz_boot.js';var __require = CC_EDITOR ? function (request) {return cc.require(request, require);} : function (request) {return cc.require(request, __filename);};function __define (exports, require, module) {"use strict";
cc._RF.push(module, '74ee79dIjZJ/Y/1Y0CuFMYn', 'ddz_boot', __filename);
// Script/ddz/ddz_boot.js

'use strict';

require('AIRobot');
require('QrOption');

// 斗地主的日志全局函数
ddz.LOGD = function (tag, msg) {
	if (!debugMode) {
		return;
	}
	var logStr = 'ddz : ' + msg;
	if (tag) {
		logStr = tag + 'ddz : ' + msg;
	}
	console.log(logStr);
};

ddz.LOGW = function (tag, msg) {
	if (!debugMode) {
		return;
	}
	var logStr = 'ddz : ' + msg;
	if (tag) {
		logStr = tag + 'ddz : ' + msg;
	}
	console.warn(logStr);
};

ddz.AI = new ddz.AIRobot();
ddz.AIRobots = new ddz.AIRobotClasss();

ddz.qrCodeOption = new ddz.QrOption();

ty.TuyooSDK.getSystemType();

// DDZ的游戏ID
ddz.GameId = 6;
ddz.CardInfoTag = 0;
ddz.FriendOpTimeOut = 30; //好友桌操作倒计时
ddz.recordFileType = 'mp3';

ddz.SETTING_MUTE_KEY = "setting_mute";
ddz.SETTING_MUSIC_KEY = "setting_music";
ddz.SETTING_EFFECT_KEY = "setting_effect";

ddz.LOCAL_VERSION_KEY = "LOCAL_VERSION_KEY"; // 本地版本号,升级后会更新


ddz.Enums = ddz.Enums || {};
// 游戏主状态

/**
 * 场景类型
 * @type {{NORMAL: number, MATCH: number, FRIEND: number}}
 */
ddz.Enums.SceneType = {
	NORMAL: 0,
	MATCH: 1,
	FRIEND: 2,
	ARENA: 3
};

ddz.Enums.GameStatus = {
	GAME_STATUS_UNKNOWN: -1,
	GAME_STATUS_LOADING: 0, // 加载中
	GAME_STATUS_IN_HALL: 1, // 在大厅中
	GAME_STATUS_CHOOSE_ROOM: 2, // 选择房间
	GAME_STATUS_BEGIN: 3, // 游戏刚刚开始
	GAME_STATUS_READY: 4, // 已经准备
	GAME_STATUS_JIAODIZHU: 5, // 叫地主阶段
	GAME_STATUS_PLAYING: 6, // 游戏中
	GAME_STATUS_END: 7 // 结束
};

ddz.Enums.CardSize = {
	CARD_SIZE_BIG: 1,
	CARD_SIZE_MIDDLE: 2,
	CARD_SIZE_SMALL: 3
};

//牌的花色
ddz.Enums.CardColor = {
	CARD_COLOR_HEITAO: 4, //黑桃
	CARD_COLOR_HONGTAO: 3, //红桃
	CARD_COLOR_CAOHUA: 2, //草花
	CARD_COLOR_FANGPIAN: 1 //方片
};

ddz.Enums.CardType = {
	CARD_TYPE_NORMAL: 1, //普通
	CARD_TYPE_KING: 2, //王
	CARD_TYPE_LAIZI: 3 //癞子
};

ddz.Enums.PlayMode = {
	PLAY_MODE_NET: 1, //联网游戏
	PLAY_MODE_SINGLE: 2, //单机游戏
	PLAY_MODE_MATCH: 3, //联网比赛
	PLAY_MODE_REPLAY: 4 //重播
};

ddz.Enums.PlayType = {
	//除了欢乐玩法，其他其实都是在经典玩法基础之上的
	PLAY_TYPE_JINGDIAN: 1, //经典玩法
	PLAY_TYPE_HUANLE: 2, //欢乐斗地主
	PLAY_TYPE_MATCH: 3, //比赛场
	PLAY_TYPE_LAIZI: 4, //癞子玩法
	PLAY_TYPE_ERREN: 5 //二人斗地主
};

ddz.Enums.PlayStatus = {
	PLAY_STATUS_PREPARE: 1, //初始
	PLAY_STATUS_JIAODZ: 2, //叫地主
	PLAY_STATUS_PLAYING: 3,
	PLAY_STATUS_GAMEOVER: 5
};

//座位状态
ddz.Enums.SeatState = {
	SEATDZSTAT_WAIT: 10,
	SEATDZSTAT_READY: 20,
	SEATDZSTAT_PLAYING: 30
};

// 桌子状态
ddz.Enums.TableState = {
	TABLEDSTAT_IDLE: 10,
	TABLEDSTAT_CALLING: 15,
	TABLEDSTAT_ITEM: 17,
	TABLEDSTAT_PLAYING: 20
};

//用户的种类
ddz.Enums.UserType = {
	GUEST_USER: 0, // 	游客账户
	EMAIL_USER: 1, // 	途游账户 (邮箱注册)
	THIRD_USER: 2, // 	第三方账户
	PHONE_USER: 3, // 	途游账户 (手机号码注册)
	ERROR_USER: 4, // 	错误
	LOCAL_USER: 5, // 	未能成功登录，单机用户
	GUEST_USER_OLD: 6, // 	游客
	TUYOO_USER: 7 // 	途游用户
};

//出牌提示： 出牌不符合规则，没有大过上家的牌, 请出牌
ddz.Enums.PlayCardsTip = {
	PLAYCARDSTIP_ILLEGAL: 0,
	PLAYCARDSTIP_NOCARD: 1,
	PLAYCARDSTIP_PLAY: 2
};

ddz.Enums.PlayerSexEnum = {
	SEX_MALE: 0,
	SEX_FEMALE: 1
};

// 牌型
ddz.Enums.PaixingType = {
	SINGLE_CARD: 1, // 单牌
	DOUBLE_CARD: 2, // 对子
	THREE_CARD: 3, // 3不带
	BOMB_CARD: 4, // 炸弹
	THREE_ONE_CARD: 5, // 3带1
	THREE_TWO_CARD: 6, // 3带2
	BOMB_TWO_CARD: 7, // 四个带2张单牌
	BOMB_TWO_TWO_CARD: 8, // 四个带2对
	SHUNZI_CARD: 9, // 顺子
	LIANDUI_CARD: 10, // 连队
	AIRCRAFT_CARD: 11, // 飞机不带
	AIRCRAFT_SINGLE_CARD: 12, // 飞机带单牌
	AIRCRAFT_DOUBLE_CARD: 13, // 飞机带对子
	ROCKET: 14, // 火箭
	ERROR_CARD: 15 // 错误的牌型
};

/********************/

ddz.SESSIONINDEX_JINGDIAN = 0;
ddz.SESSIONINDEX_HUANLE = 1;
ddz.SESSIONINDEX_MATCH = 2;
ddz.SESSIONINDEX_LAIZI = 3;
ddz.SESSIONINDEX_ERREN = 4;

ddz.CARD_BIG_SIZE = cc.size(142, 204);

ddz.CARD_MIDDLE_SIZE = cc.size(86, 106);
ddz.CARD_SMALL_SIZE = cc.size(44, 61);
ddz.PLAYED_CARDS_MAXINLINE = 6;

ddz.CHAT_COOLING_TIMER_LEFT = -1;
ddz.CHAT_COOLING_TIMER_RIGHT = -1;

ddz.CARD_MAX_INTERVAL = 0.5;
ddz.CARD_MIN_INTERVAL = 0.387;
ddz.CARD_MIDDLE_INTERVAL = 0.45;

ddz.SINGLE_SCORE_BASE = 1;

// 每桌最大的座位数
ddz.MAX_SEAT_COUNT = 3;

//开始播放闹钟动画时间
ddz.CLOCK_ANIMATION_SECOND = 5;

//分享回来提示弹窗tag

ddz.BUCHU_BUTTON_KEY = "buchu";
ddz.RECHOOSE_BUTTON_KEY = "rechoose";
ddz.TISHI_BUTTON_KEY = "tishi";
ddz.PLAY_BUTTON_KEY = "play";

ddz.MSG_TEXT_BUCHU = "不出";

ddz.ROLE_ACTION = {
	CHANGTAI: 'changtai',
	SHENGLI: 'shengli',
	SHIBAI: 'shibai',
	SIKAO: 'sikao'
};

ddz.MATCH_REASON = {
	WIN: 1,
	FAIL: 0
};

ddz.LOCATION_SIGN = {
	LEFT: 12,
	RIGHT: 11,
	SELF: 10
};

ddz.PlayMode = {
	classify: '123',
	happy: 'happy',
	change: 'huan3cards',
	power: 'wild',
	quick_power: 'quick_laizi'
};

ddz.constellationConfig = ["白羊座", "金牛座", "双子座", "巨蟹座", "狮子座", "处女座", "天秤座", "天蝎座", "射手座", "摩羯座", "水瓶座", "双鱼座"];

ddz.cityConfig = {
	"北京市": [{
		"市级": "东城区"
	}, {
		"市级": "西城区"
	}, {
		"市级": "崇文区"
	}, {
		"市级": "宣武区"
	}, {
		"市级": "朝阳区"
	}, {
		"市级": "丰台区"
	}, {
		"市级": "石景山区"
	}, {
		"市级": "海淀区"
	}, {
		"市级": "门头沟区"
	}, {
		"市级": "房山区"
	}, {
		"市级": "通州区"
	}, {
		"市级": "顺义区"
	}, {
		"市级": "昌平区"
	}, {
		"市级": "大兴区"
	}, {
		"市级": "平谷区"
	}, {
		"市级": "怀柔区"
	}, {
		"市级": "密云县"
	}, {
		"市级": "延庆县"
	}],
	"天津市": [{
		"市级": "和平区"
	}, {
		"市级": "河东区"
	}, {
		"市级": "河西区"
	}, {
		"市级": "南开区"
	}, {
		"市级": "河北区"
	}, {
		"市级": "红桥区"
	}, {
		"市级": "塘沽区"
	}, {
		"市级": "汉沽区"
	}, {
		"市级": "大港区"
	}, {
		"市级": "东丽区"
	}, {
		"市级": "西青区"
	}, {
		"市级": "津南区"
	}, {
		"市级": "北辰区"
	}, {
		"市级": "武清区"
	}, {
		"市级": "宝坻区"
	}, {
		"市级": "宁河县"
	}, {
		"市级": "静海县"
	}, {
		"市级": "蓟县"
	}],
	"河北省": [{
		"市级": "石家庄市"
	}, {
		"市级": "唐山市"
	}, {
		"市级": "秦皇岛市"
	}, {
		"市级": "邯郸市"
	}, {
		"市级": "邢台市"
	}, {
		"市级": "保定市"
	}, {
		"市级": "张家口市"
	}, {
		"市级": "承德市"
	}, {
		"市级": "沧州市"
	}, {
		"市级": "廊坊市"
	}, {
		"市级": "衡水市"
	}],
	"山西省": [{
		"市级": "太原市"
	}, {
		"市级": "大同市"
	}, {
		"市级": "阳泉市"
	}, {
		"市级": "长治市"
	}, {
		"市级": "晋城市"
	}, {
		"市级": "朔州市"
	}, {
		"市级": "忻州市"
	}, {
		"市级": "吕梁市"
	}, {
		"市级": "晋中市"
	}, {
		"市级": "临汾市"
	}, {
		"市级": "运城市"
	}],
	"内蒙古": [{
		"市级": "呼和浩特市"
	}, {
		"市级": "赤峰市"
	}, {
		"市级": "呼伦贝尔市"
	}, {
		"市级": "兴安盟"
	}, {
		"市级": "通辽市"
	}, {
		"市级": "锡林郭勒盟"
	}, {
		"市级": "乌兰察布盟"
	}, {
		"市级": "伊克昭盟"
	}, {
		"市级": "巴彦淖尔盟"
	}, {
		"市级": "阿拉善盟"
	}],
	"辽宁省": [{
		"市级": "沈阳市"
	}, {
		"市级": "抚顺市"
	}, {
		"市级": "本溪市"
	}, {
		"市级": "丹东市"
	}, {
		"市级": "锦州市"
	}, {
		"市级": "营口市"
	}, {
		"市级": "阜新市"
	}, {
		"市级": "辽阳市"
	}, {
		"市级": "盘锦市"
	}, {
		"市级": "铁岭市"
	}, {
		"市级": "朝阳市"
	}, {
		"市级": "葫芦岛市"
	}],
	"吉林省": [{
		"市级": "长春市"
	}, {
		"市级": "辽源市"
	}, {
		"市级": "通化市"
	}, {
		"市级": "白山市"
	}, {
		"市级": "松原市"
	}, {
		"市级": "白城市"
	}, {
		"市级": "延边"
	}],
	"黑龙江省": [{
		"市级": "哈尔滨市"
	}, {
		"市级": "鹤岗市"
	}, {
		"市级": "双鸭山市"
	}, {
		"市级": "大庆市"
	}, {
		"市级": "伊春市"
	}, {
		"市级": "七台河市"
	}, {
		"市级": "牡丹江市"
	}, {
		"市级": "黑河市"
	}, {
		"市级": "绥化市"
	}, {
		"市级": "大兴安岭"
	}],
	"上海市": [{
		"市级": "浦东新区"
	}, {
		"市级": "徐汇区"
	}, {
		"市级": "黄浦区"
	}, {
		"市级": "杨浦区"
	}, {
		"市级": "虹口区"
	}, {
		"市级": "闵行区"
	}, {
		"市级": "长宁区"
	}, {
		"市级": "普陀区"
	}, {
		"市级": "宝山区"
	}, {
		"市级": "静安区"
	}, {
		"市级": "闸北区"
	}, {
		"市级": "卢湾区"
	}, {
		"市级": "松江区"
	}, {
		"市级": "嘉定区"
	}, {
		"市级": "南汇区"
	}, {
		"市级": "金山区"
	}, {
		"市级": "青浦区"
	}, {
		"市级": "奉贤区"
	}, {
		"市级": "崇明县"
	}],
	"江苏省": [{
		"市级": "南京市"
	}, {
		"市级": "常州市"
	}, {
		"市级": "苏州市"
	}, {
		"市级": "南通市"
	}, {
		"市级": "连云港市"
	}, {
		"市级": "淮阴市"
	}, {
		"市级": "盐城市"
	}, {
		"市级": "扬州市"
	}, {
		"市级": "镇江市"
	}, {
		"市级": "泰州市"
	}, {
		"市级": "宿迁市"
	}],
	"浙江省": [{
		"市级": "杭州市"
	}, {
		"市级": "嘉兴市"
	}, {
		"市级": "湖州市"
	}, {
		"市级": "绍兴市"
	}, {
		"市级": "金华市"
	}, {
		"市级": "衢州市"
	}, {
		"市级": "舟山市"
	}, {
		"市级": "台州市"
	}, {
		"市级": "丽水市"
	}],
	"安徽省": [{
		"市级": "合肥市"
	}, {
		"市级": "淮南市"
	}, {
		"市级": "马鞍山市"
	}, {
		"市级": "淮北市"
	}, {
		"市级": "铜陵市"
	}, {
		"市级": "安庆市"
	}, {
		"市级": "黄山市"
	}, {
		"市级": "滁州市"
	}, {
		"市级": "阜阳市"
	}, {
		"市级": "宿州市"
	}, {
		"市级": "六安市"
	}, {
		"市级": "宣城市"
	}, {
		"市级": "巢湖市"
	}, {
		"市级": "池州市"
	}],
	"福建省": [{
		"市级": "福州市"
	}, {
		"市级": "莆田市"
	}, {
		"市级": "泉州市"
	}, {
		"市级": "漳州市"
	}, {
		"市级": "龙岩"
	}, {
		"市级": "三明市"
	}, {
		"市级": "南平市"
	}],
	"江西省": [{
		"市级": "南昌市"
	}, {
		"市级": "九江市"
	}, {
		"市级": "新余市"
	}, {
		"市级": "鹰潭市"
	}, {
		"市级": "赣州市"
	}, {
		"市级": "宜春市"
	}, {
		"市级": "上饶市"
	}, {
		"市级": "吉安市"
	}, {
		"市级": "抚州市"
	}],
	"山东省": [{
		"市级": "济南市"
	}, {
		"市级": "枣庄市"
	}, {
		"市级": "东营市"
	}, {
		"市级": "烟台市"
	}, {
		"市级": "潍坊市"
	}, {
		"市级": "济宁市"
	}, {
		"市级": "泰安市"
	}, {
		"市级": "威海市"
	}, {
		"市级": "日照市"
	}, {
		"市级": "莱芜市"
	}, {
		"市级": "临沂市"
	}, {
		"市级": "德州市"
	}, {
		"市级": "聊城市"
	}, {
		"市级": "滨州"
	}, {
		"市级": "菏泽"
	}],
	"河南省": [{
		"市级": "郑州市"
	}, {
		"市级": "洛阳市"
	}, {
		"市级": "平顶山市"
	}, {
		"市级": "安阳市"
	}, {
		"市级": "鹤壁市"
	}, {
		"市级": "新乡市"
	}, {
		"市级": "焦作市"
	}, {
		"市级": "濮阳市"
	}, {
		"市级": "许昌市"
	}, {
		"市级": "漯河市"
	}, {
		"市级": "三门峡市"
	}, {
		"市级": "南阳市"
	}, {
		"市级": "商丘市"
	}, {
		"市级": "信阳市"
	}, {
		"市级": "周口市"
	}, {
		"市级": "驻马店"
	}],
	"湖北省": [{
		"市级": "武汉市"
	}, {
		"市级": "宜昌市"
	}, {
		"市级": "襄樊市"
	}, {
		"市级": "鄂州市"
	}, {
		"市级": "荆门市"
	}, {
		"市级": "孝感市"
	}, {
		"市级": "荆州市"
	}, {
		"市级": "黄冈市"
	}, {
		"市级": "咸宁市"
	}, {
		"市级": "恩施"
	}],
	"湖南省": [{
		"市级": "长沙市"
	}, {
		"市级": "衡阳市"
	}, {
		"市级": "邵阳市"
	}, {
		"市级": "岳阳市"
	}, {
		"市级": "常德市"
	}, {
		"市级": "张家界市"
	}, {
		"市级": "益阳市"
	}, {
		"市级": "郴州市"
	}, {
		"市级": "永州市"
	}, {
		"市级": "怀化市"
	}, {
		"市级": "娄底地区"
	}, {
		"市级": "湘西"
	}],
	"广东省": [{
		"市级": "广州市"
	}, {
		"市级": "珠海市"
	}, {
		"市级": "汕头市"
	}, {
		"市级": "佛山市"
	}, {
		"市级": "江门市"
	}, {
		"市级": "湛江市"
	}, {
		"市级": "茂名市"
	}, {
		"市级": "肇庆市"
	}, {
		"市级": "惠州市"
	}, {
		"市级": "梅州市"
	}, {
		"市级": "汕尾市"
	}, {
		"市级": "河源市"
	}, {
		"市级": "阳江市"
	}, {
		"市级": "清远市"
	}, {
		"市级": "东莞市"
	}, {
		"市级": "中山市"
	}, {
		"市级": "潮州市"
	}, {
		"市级": "揭阳市"
	}, {
		"市级": "云浮市"
	}],
	"广西": [{
		"市级": "南宁市"
	}, {
		"市级": "梧州市"
	}, {
		"市级": "北海市"
	}, {
		"市级": "防城港市"
	}, {
		"市级": "钦州市"
	}, {
		"市级": "贵港市"
	}, {
		"市级": "玉林市"
	}, {
		"市级": "崇左市"
	}, {
		"市级": "来宾市"
	}, {
		"市级": "贺州市"
	}, {
		"市级": "百色市"
	}, {
		"市级": "河池市"
	}],
	"海南省": [{
		"市级": "海口市"
	}, {
		"市级": "三亚市"
	}],
	"重庆市": [{
		"市级": "万州区"
	}, {
		"市级": "涪陵区"
	}, {
		"市级": "渝中区"
	}, {
		"市级": "大渡口区"
	}, {
		"市级": "江北区"
	}, {
		"市级": "沙坪坝区"
	}, {
		"市级": "九龙坡区"
	}, {
		"市级": "南岸区"
	}, {
		"市级": "北碚区"
	}, {
		"市级": "万盛区"
	}, {
		"市级": "双桥区"
	}, {
		"市级": "渝北区"
	}, {
		"市级": "巴南区"
	}, {
		"市级": "长寿县"
	}, {
		"市级": "綦江县"
	}, {
		"市级": "潼南县"
	}, {
		"市级": "铜梁县"
	}, {
		"市级": "大足县"
	}, {
		"市级": "荣昌县"
	}, {
		"市级": "璧山县"
	}, {
		"市级": "梁平县"
	}, {
		"市级": "城口县"
	}, {
		"市级": "丰都县"
	}, {
		"市级": "垫江县"
	}, {
		"市级": "武隆县"
	}, {
		"市级": "忠县"
	}, {
		"市级": "开县"
	}, {
		"市级": "云阳县"
	}, {
		"市级": "奉节县"
	}, {
		"市级": "巫山县"
	}, {
		"市级": "巫溪县"
	}, {
		"市级": "黔江"
	}, {
		"市级": "石柱"
	}, {
		"市级": "秀山"
	}, {
		"市级": "酉阳"
	}, {
		"市级": "彭水"
	}, {
		"市级": "江津市"
	}, {
		"市级": "合川市"
	}, {
		"市级": "永川市"
	}, {
		"市级": "南川市"
	}],
	"四川省": [{
		"市级": "成都市"
	}, {
		"市级": "泸州市"
	}, {
		"市级": "德阳市"
	}, {
		"市级": "绵阳市"
	}, {
		"市级": "广元市"
	}, {
		"市级": "遂宁市"
	}, {
		"市级": "内江市"
	}, {
		"市级": "乐山市"
	}, {
		"市级": "南充市"
	}, {
		"市级": "宜宾市"
	}, {
		"市级": "广安市"
	}, {
		"市级": "达川地区"
	}, {
		"市级": "雅安地区"
	}, {
		"市级": "阿坝"
	}, {
		"市级": "甘孜"
	}, {
		"市级": "凉山"
	}, {
		"市级": "巴中地区"
	}, {
		"市级": "眉山地区"
	}, {
		"市级": "资阳地区"
	}, {
		"北京市": "贵州省",
		"市级": "贵阳市"
	}, {
		"市级": "铜仁"
	}, {
		"市级": "黔西南"
	}, {
		"市级": "毕节"
	}, {
		"市级": "安顺"
	}, {
		"市级": "黔东南"
	}, {
		"市级": "黔南"
	}, {
		"北京市": "云南省",
		"市级": "昆明市"
	}, {
		"市级": "昭通"
	}, {
		"市级": "楚雄"
	}, {
		"市级": "红河"
	}, {
		"市级": "文山"
	}, {
		"市级": "思茅市"
	}, {
		"市级": "西双版纳"
	}, {
		"市级": "大理"
	}, {
		"市级": "保山"
	}, {
		"市级": "德宏"
	}, {
		"市级": "丽江"
	}, {
		"市级": "怒江"
	}, {
		"市级": "迪庆"
	}, {
		"市级": "临沧"
	}, {
		"北京市": "西藏",
		"市级": "拉萨市"
	}, {
		"市级": "日喀则"
	}, {
		"市级": "那曲"
	}, {
		"市级": "阿里"
	}, {
		"市级": "林芝"
	}, {
		"北京市": "陕西省",
		"市级": "西安市"
	}, {
		"市级": "咸阳市"
	}, {
		"市级": "渭南市"
	}, {
		"市级": "延安市"
	}, {
		"市级": "汉中市"
	}, {
		"市级": "安康"
	}, {
		"市级": "商洛"
	}, {
		"市级": "榆林"
	}],
	"甘肃省": [{
		"市级": "兰州市"
	}, {
		"市级": "天水市"
	}, {
		"市级": "酒泉"
	}, {
		"市级": "张掖"
	}, {
		"市级": "武威"
	}, {
		"市级": "定西"
	}, {
		"市级": "陇南"
	}, {
		"市级": "平凉"
	}, {
		"市级": "庆阳"
	}, {
		"市级": "临夏"
	}, {
		"市级": "甘南"
	}],
	"青海省": [{
		"市级": "西宁市"
	}, {
		"市级": "黄南"
	}, {
		"市级": "海南"
	}, {
		"市级": "果洛"
	}, {
		"市级": "玉树"
	}, {
		"市级": "海西"
	}],
	"宁夏": [{
		"市级": "银川市"
	}, {
		"市级": "固原"
	}, {
		"市级": "中卫市"
	}],
	"新疆": [{
		"市级": "乌鲁木齐市"
	}, {
		"市级": "哈密地区"
	}, {
		"市级": "昌吉"
	}, {
		"市级": "博尔塔拉"
	}, {
		"市级": "巴音郭楞"
	}, {
		"市级": "阿克苏"
	}, {
		"市级": "克孜勒苏柯尔克孜"
	}, {
		"市级": "喀什"
	}, {
		"市级": "和田"
	}, {
		"市级": "伊犁"
	}, {
		"市级": "塔城"
	}, {
		"市级": "阿勒泰"
	}]
};

cc._RF.pop();
        }
        if (CC_EDITOR) {
            __define(__module.exports, __require, __module);
        }
        else {
            cc.registerModuleFunc(__filename, function () {
                __define(__module.exports, __require, __module);
            });
        }
        })();
        //# sourceMappingURL=ddz_boot.js.map
        